Repository: giellalt/corpus-sms
Catalog: prestable/tmx/sms2fin/admin/sd/sami_parlamentarals_raddi_fi/ilmastomuutosta27.pdf.tmx
Source language: sms
Languages: fin

source: Valdiain âlgg uŠvdded põõšši teäggtõs näkkam tuâjai hoiddu.
fin: Valtioiden tulee antaa pysyvä rahoitus näiden tehtävien hoitoon.

source: SPN vuäinn, što äimm-muuttõštuŠtǩǩumuužž âlgg lââŠzzted da tuŠtǩǩumuužžâst âlgg åårsted smiõttâd eärben äimm-muuttõõzz vaikktõõzzi da hääitai uuŠcceem diõtt aartkla vuõssnaroodi jälstemvuuŠdid.
fin: SPN näkee, että ilmastonmuutostutkimusta on lisättävä ja tutkimuksessa on keskityttävä erityisesti ilmastonmuutoksen vaikutuksien ja haittojen minimoimiseen arktisten alkuperäiskansojen asumaalueilla.

source: TuŠtǩǩumuužž da tuŠtǩǩeemteäggtõõzz õõlǥŠči koordinoida õhttsažtuâjast valdiai, aartkla suåvtõõzz da äv.
fin: Tutkimusta ja tutkimusrahoitusta tulisi koordinoida yhteistyössä valtioiden, arktisen neuvoston ja ao.

source: vuõssnaroodin.
fin: alkuperäiskansan kanssa.

source: SaaŠmi parlamenttaarlaž suåvtõs auŠǯǯai Taarr, Ruõcc da LääŠddjânnam sääŠmteeŠǧǧid čõnnõõttâd ooudâsviikkâd tuåimid ǩeâllʼjem šõddmõõžži mieŠlddsânji energiiäuŠǩǩeem viõkksmâŠttem diõtt da äimm-muttõõzz šõddeei kaaŠsti cõggâm diõtt.
fin: Saamelainen parlamentaarinen neuvosto kehottaa Norjan, Ruotsin ja Suomen saamelaiskäräjiä sitoutumaan edistämään toimia kestävän kehityksen mukaisesti energiahyödyntämisen tehostamiseksi ja ilmastonmuutosta aiheuttavia päästöjen hillitsemiseksi.

source: SPN âlgg tuåimmjed ooudâsviiǥǥeeŠl ođđsmõõvvâm energiivueŠjji âânnmõõžž.
fin: SPR tulee toimia edistääkseen uudistuvien energiamuotojen käyttöä.

source: SPN čõnnââtt raajjâd äimmpolitiikkla prograamm.
fin: SPN sitoutuu laatimaan ilmastopoliittisen ohjelman.
